import Cocoa

class InputMethod : NSObject {
    let DAU_SAC = g("1");
    let DAU_HUYEN = g("2");
    let DAU_HOI = g("3");
    let DAU_NGA = g("4");
    let DAU_NANG = g("5");
    let DAU_MU = g("6");
    let DAU_RAU = g("7");
    let DAU_RAU_2 = g("8");
    let DAU_NGANG = g("9");

    var CONTROL_CHAR: [UniChar: [UniChar: UniChar]] = [:]

    override init() {
        super.init()

        CONTROL_CHAR = [
            DAU_SAC: [
                g("a"): g("á"), g("à"): g("á"), g("ả"): g("á"), g("ã"): g("á"), g("ạ"): g("á"),
                g("ă"): g("ắ"), g("ằ"): g("ắ"), g("ẳ"): g("ắ"), g("ẵ"): g("ắ"), g("ặ"): g("ắ"),
                g("â"): g("ấ"), g("ầ"): g("ấ"), g("ẩ"): g("ấ"), g("ẫ"): g("ấ"), g("ậ"): g("ấ"),
                g("o"): g("ó"), g("ò"): g("ó"), g("ỏ"): g("ó"), g("õ"): g("ó"), g("ọ"): g("ó"),
                g("ô"): g("ố"), g("ồ"): g("ố"), g("ổ"): g("ố"), g("ỗ"): g("ố"), g("ộ"): g("ố"),
                g("ơ"): g("ớ"), g("ờ"): g("ớ"), g("ở"): g("ớ"), g("ỡ"): g("ớ"), g("ợ"): g("ớ"),
                g("e"): g("é"), g("è"): g("é"), g("ẻ"): g("é"), g("ẽ"): g("é"), g("ẹ"): g("é"),
                g("ê"): g("ế"), g("ề"): g("ế"), g("ể"): g("ế"), g("ễ"): g("ế"), g("ệ"): g("ế"),
                g("u"): g("ú"), g("ù"): g("ú"), g("ủ"): g("ú"), g("ũ"): g("ú"), g("ụ"): g("ú"),
                g("ư"): g("ứ"), g("ừ"): g("ứ"), g("ử"): g("ứ"), g("ữ"): g("ứ"), g("ự"): g("ứ"),
                g("i"): g("í"), g("ì"): g("í"), g("ỉ"): g("í"), g("ĩ"): g("í"), g("ị"): g("í"),
                g("y"): g("ý"), g("ỳ"): g("ý"), g("ỷ"): g("ý"), g("ỹ"): g("ý"), g("ỵ"): g("ý"),

                g("A"): g("Á"), g("À"): g("Á"), g("Ả"): g("Á"), g("Ã"): g("Á"), g("Ạ"): g("Á"),
                g("Ă"): g("Ắ"), g("Ằ"): g("Ắ"), g("Ẳ"): g("Ắ"), g("Ẵ"): g("Ắ"), g("Ặ"): g("Ắ"),
                g("Â"): g("Ấ"), g("Ầ"): g("Ấ"), g("Ẩ"): g("Ấ"), g("Ẫ"): g("Ấ"), g("Ậ"): g("Ấ"),
                g("O"): g("Ó"), g("Ò"): g("Ó"), g("Ỏ"): g("Ó"), g("Õ"): g("Ó"), g("Ọ"): g("Ó"),
                g("Ô"): g("Ố"), g("Ồ"): g("Ố"), g("Ổ"): g("Ố"), g("Ỗ"): g("Ố"), g("Ộ"): g("Ố"),
                g("Ơ"): g("Ớ"), g("Ờ"): g("Ớ"), g("Ở"): g("Ớ"), g("Ỡ"): g("Ớ"), g("Ợ"): g("Ớ"),
                g("E"): g("É"), g("È"): g("É"), g("Ẻ"): g("É"), g("Ẽ"): g("É"), g("Ẹ"): g("É"),
                g("Ê"): g("Ế"), g("Ề"): g("Ế"), g("Ể"): g("Ế"), g("Ễ"): g("Ế"), g("Ệ"): g("Ế"),
                g("U"): g("Ú"), g("Ù"): g("Ú"), g("Ủ"): g("Ú"), g("Ũ"): g("Ú"), g("Ụ"): g("Ú"),
                g("Ư"): g("Ứ"), g("Ừ"): g("Ứ"), g("Ử"): g("Ứ"), g("Ữ"): g("Ứ"), g("Ự"): g("Ứ"),
                g("I"): g("Í"), g("Ì"): g("Í"), g("Ỉ"): g("Í"), g("Ĩ"): g("Í"), g("Ị"): g("Í"),
                g("Y"): g("Ý"), g("Ỳ"): g("Ý"), g("Ỷ"): g("Ý"), g("Ỹ"): g("Ý"), g("Ỵ"): g("Ý"),
            ],
            DAU_HUYEN: [
                g("a"): g("à"), g("á"): g("à"), g("ả"): g("à"), g("ã"): g("à"), g("ạ"): g("à"),
                g("ă"): g("ằ"), g("ắ"): g("ằ"), g("ẳ"): g("ằ"), g("ẵ"): g("ằ"), g("ặ"): g("ằ"),
                g("â"): g("ầ"), g("ấ"): g("ầ"), g("ẩ"): g("ầ"), g("ẫ"): g("ầ"), g("ậ"): g("ầ"),
                g("o"): g("ò"), g("ó"): g("ò"), g("ỏ"): g("ò"), g("õ"): g("ò"), g("ọ"): g("ò"),
                g("ô"): g("ồ"), g("ố"): g("ồ"), g("ổ"): g("ồ"), g("ỗ"): g("ồ"), g("ộ"): g("ồ"),
                g("ơ"): g("ờ"), g("ớ"): g("ờ"), g("ở"): g("ờ"), g("ỡ"): g("ờ"), g("ợ"): g("ờ"),
                g("e"): g("è"), g("é"): g("è"), g("ẻ"): g("è"), g("ẽ"): g("è"), g("ẹ"): g("è"),
                g("ê"): g("ề"), g("ế"): g("ề"), g("ể"): g("ề"), g("ễ"): g("ề"), g("ệ"): g("ề"),
                g("u"): g("ù"), g("ú"): g("ù"), g("ủ"): g("ù"), g("ũ"): g("ù"), g("ụ"): g("ù"),
                g("ư"): g("ừ"), g("ứ"): g("ừ"), g("ử"): g("ừ"), g("ữ"): g("ừ"), g("ự"): g("ừ"),
                g("i"): g("ì"), g("í"): g("ì"), g("ỉ"): g("ì"), g("ĩ"): g("ì"), g("ị"): g("ì"),
                g("y"): g("ỳ"), g("ý"): g("ỳ"), g("ỷ"): g("ỳ"), g("ỹ"): g("ỳ"), g("ỵ"): g("ỳ"),

                g("A"): g("À"), g("Á"): g("À"), g("Ả"): g("À"), g("Ã"): g("À"), g("Ạ"): g("À"),
                g("Ă"): g("Ằ"), g("Ắ"): g("Ằ"), g("Ẳ"): g("Ằ"), g("Ẵ"): g("Ằ"), g("Ặ"): g("Ằ"),
                g("Â"): g("Ầ"), g("Ấ"): g("Ầ"), g("Ẩ"): g("Ầ"), g("Ẫ"): g("Ầ"), g("Ậ"): g("Ầ"),
                g("O"): g("Ò"), g("Ó"): g("Ò"), g("Ỏ"): g("Ò"), g("Õ"): g("Ò"), g("Ọ"): g("Ò"),
                g("Ô"): g("Ồ"), g("Ố"): g("Ồ"), g("Ổ"): g("Ồ"), g("Ỗ"): g("Ồ"), g("Ộ"): g("Ồ"),
                g("Ơ"): g("Ờ"), g("Ớ"): g("Ờ"), g("Ở"): g("Ờ"), g("Ỡ"): g("Ờ"), g("Ợ"): g("Ờ"),
                g("E"): g("È"), g("É"): g("È"), g("Ẻ"): g("È"), g("Ẽ"): g("È"), g("Ẹ"): g("È"),
                g("Ê"): g("Ề"), g("Ế"): g("Ề"), g("Ể"): g("Ề"), g("Ễ"): g("Ề"), g("Ệ"): g("Ề"),
                g("U"): g("Ù"), g("Ú"): g("Ù"), g("Ủ"): g("Ù"), g("Ũ"): g("Ù"), g("Ụ"): g("Ù"),
                g("Ư"): g("Ừ"), g("Ứ"): g("Ừ"), g("Ử"): g("Ừ"), g("Ữ"): g("Ừ"), g("Ự"): g("Ừ"),
                g("I"): g("Ì"), g("Í"): g("Ì"), g("Ỉ"): g("Ì"), g("Ĩ"): g("Ì"), g("Ị"): g("Ì"),
                g("Y"): g("Ỳ"), g("Ý"): g("Ỳ"), g("Ỷ"): g("Ỳ"), g("Ỹ"): g("Ỳ"), g("Ỵ"): g("Ỳ"),
            ],
            DAU_HOI: [
                g("a"): g("ả"), g("á"): g("ả"), g("à"): g("ả"), g("ã"): g("ả"), g("ạ"): g("ả"),
                g("ă"): g("ẳ"), g("ắ"): g("ẳ"), g("ằ"): g("ẳ"), g("ẵ"): g("ẳ"), g("ặ"): g("ẳ"),
                g("â"): g("ẩ"), g("ấ"): g("ẩ"), g("ầ"): g("ẩ"), g("ẫ"): g("ẩ"), g("ậ"): g("ẩ"),
                g("o"): g("ỏ"), g("ó"): g("ỏ"), g("ò"): g("ỏ"), g("õ"): g("ỏ"), g("ọ"): g("ỏ"),
                g("ô"): g("ổ"), g("ố"): g("ổ"), g("ồ"): g("ổ"), g("ỗ"): g("ổ"), g("ộ"): g("ổ"),
                g("ơ"): g("ở"), g("ớ"): g("ở"), g("ờ"): g("ở"), g("ỡ"): g("ở"), g("ợ"): g("ở"),
                g("e"): g("ẻ"), g("é"): g("ẻ"), g("è"): g("ẻ"), g("ẽ"): g("ẻ"), g("ẹ"): g("ẻ"),
                g("ê"): g("ể"), g("ế"): g("ể"), g("ề"): g("ể"), g("ễ"): g("ể"), g("ệ"): g("ể"),
                g("u"): g("ủ"), g("ú"): g("ủ"), g("ù"): g("ủ"), g("ũ"): g("ủ"), g("ụ"): g("ủ"),
                g("ư"): g("ử"), g("ứ"): g("ử"), g("ừ"): g("ử"), g("ữ"): g("ử"), g("ự"): g("ử"),
                g("i"): g("ỉ"), g("í"): g("ỉ"), g("ì"): g("ỉ"), g("ĩ"): g("ỉ"), g("ị"): g("ỉ"),
                g("y"): g("ỷ"), g("ý"): g("ỷ"), g("ỳ"): g("ỷ"), g("ỹ"): g("ỷ"), g("ỵ"): g("ỷ"),

                g("A"): g("Ả"), g("Á"): g("Ả"), g("À"): g("Ả"), g("Ã"): g("Ả"), g("Ạ"): g("Ả"),
                g("Ă"): g("Ẳ"), g("Ắ"): g("Ẳ"), g("Ằ"): g("Ẳ"), g("Ẵ"): g("Ẳ"), g("Ặ"): g("Ẳ"),
                g("Â"): g("Ẩ"), g("Ấ"): g("Ẩ"), g("Ầ"): g("Ẩ"), g("Ẫ"): g("Ẩ"), g("Ậ"): g("Ẩ"),
                g("O"): g("Ỏ"), g("Ó"): g("Ỏ"), g("Ò"): g("Ỏ"), g("Õ"): g("Ỏ"), g("Ọ"): g("Ỏ"),
                g("Ô"): g("Ổ"), g("Ố"): g("Ổ"), g("Ồ"): g("Ổ"), g("Ỗ"): g("Ổ"), g("Ộ"): g("Ổ"),
                g("Ơ"): g("Ở"), g("Ớ"): g("Ở"), g("Ờ"): g("Ở"), g("Ỡ"): g("Ở"), g("Ợ"): g("Ở"),
                g("E"): g("Ẻ"), g("É"): g("Ẻ"), g("È"): g("Ẻ"), g("Ẽ"): g("Ẻ"), g("Ẹ"): g("Ẻ"),
                g("Ê"): g("Ể"), g("Ế"): g("Ể"), g("Ề"): g("Ể"), g("Ễ"): g("Ể"), g("Ệ"): g("Ể"),
                g("U"): g("Ủ"), g("Ú"): g("Ủ"), g("Ù"): g("Ủ"), g("Ũ"): g("Ủ"), g("Ụ"): g("Ủ"),
                g("Ư"): g("Ử"), g("Ứ"): g("Ử"), g("Ừ"): g("Ử"), g("Ữ"): g("Ử"), g("Ự"): g("Ử"),
                g("I"): g("Ỉ"), g("Í"): g("Ỉ"), g("Ì"): g("Ỉ"), g("Ĩ"): g("Ỉ"), g("Ị"): g("Ỉ"),
                g("Y"): g("Ỷ"), g("Ý"): g("Ỷ"), g("Ỳ"): g("Ỷ"), g("Ỹ"): g("Ỷ"), g("Ỵ"): g("Ỷ"),
            ],
            DAU_NGA: [
                g("a"): g("ã"), g("á"): g("ã"), g("à"): g("ã"), g("ả"): g("ã"), g("ạ"): g("ã"),
                g("ă"): g("ẵ"), g("ắ"): g("ẵ"), g("ằ"): g("ẵ"), g("ẳ"): g("ẵ"), g("ặ"): g("ẵ"),
                g("â"): g("ẫ"), g("ấ"): g("ẫ"), g("ầ"): g("ẫ"), g("ẩ"): g("ẫ"), g("ậ"): g("ẫ"),
                g("o"): g("õ"), g("ó"): g("õ"), g("ò"): g("õ"), g("ỏ"): g("õ"), g("ọ"): g("õ"),
                g("ô"): g("ỗ"), g("ố"): g("ỗ"), g("ồ"): g("ỗ"), g("ổ"): g("ỗ"), g("ộ"): g("ỗ"),
                g("ơ"): g("ỡ"), g("ớ"): g("ỡ"), g("ờ"): g("ỡ"), g("ở"): g("ỡ"), g("ợ"): g("ỡ"),
                g("e"): g("ẽ"), g("é"): g("ẽ"), g("è"): g("ẽ"), g("ẻ"): g("ẽ"), g("ẹ"): g("ẽ"),
                g("ê"): g("ễ"), g("ế"): g("ễ"), g("ề"): g("ễ"), g("ể"): g("ễ"), g("ệ"): g("ễ"),
                g("u"): g("ũ"), g("ú"): g("ũ"), g("ù"): g("ũ"), g("ủ"): g("ũ"), g("ụ"): g("ũ"),
                g("ư"): g("ữ"), g("ứ"): g("ữ"), g("ừ"): g("ữ"), g("ử"): g("ữ"), g("ự"): g("ữ"),
                g("i"): g("ĩ"), g("í"): g("ĩ"), g("ì"): g("ĩ"), g("ỉ"): g("ĩ"), g("ị"): g("ĩ"),
                g("y"): g("ỹ"), g("ý"): g("ỹ"), g("ỳ"): g("ỹ"), g("ỷ"): g("ỹ"), g("ỵ"): g("ỹ"),

                g("A"): g("Ã"), g("Á"): g("Ã"), g("À"): g("Ã"), g("Ả"): g("Ã"), g("Ạ"): g("Ã"),
                g("Ă"): g("Ẵ"), g("Ắ"): g("Ẵ"), g("Ằ"): g("Ẵ"), g("Ẳ"): g("Ẵ"), g("Ặ"): g("Ẵ"),
                g("Â"): g("Ẫ"), g("Ấ"): g("Ẫ"), g("Ầ"): g("Ẫ"), g("Ẩ"): g("Ẫ"), g("Ậ"): g("Ẫ"),
                g("O"): g("Õ"), g("Ó"): g("Õ"), g("Ò"): g("Õ"), g("Ỏ"): g("Õ"), g("Ọ"): g("Õ"),
                g("Ô"): g("Ỗ"), g("Ố"): g("Ỗ"), g("Ồ"): g("Ỗ"), g("Ổ"): g("Ỗ"), g("Ộ"): g("Ỗ"),
                g("Ơ"): g("Ỡ"), g("Ớ"): g("Ỡ"), g("Ờ"): g("Ỡ"), g("Ở"): g("Ỡ"), g("Ợ"): g("Ỡ"),
                g("E"): g("Ẽ"), g("É"): g("Ẽ"), g("È"): g("Ẽ"), g("Ẻ"): g("Ẽ"), g("Ẹ"): g("Ẽ"),
                g("Ê"): g("Ễ"), g("Ế"): g("Ễ"), g("Ề"): g("Ễ"), g("Ể"): g("Ễ"), g("Ệ"): g("Ễ"),
                g("U"): g("Ũ"), g("Ú"): g("Ũ"), g("Ù"): g("Ũ"), g("Ủ"): g("Ũ"), g("Ụ"): g("Ũ"),
                g("Ư"): g("Ữ"), g("Ứ"): g("Ữ"), g("Ừ"): g("Ữ"), g("Ử"): g("Ữ"), g("Ự"): g("Ữ"),
                g("I"): g("Ĩ"), g("Í"): g("Ĩ"), g("Ì"): g("Ĩ"), g("Ỉ"): g("Ĩ"), g("Ị"): g("Ĩ"),
                g("Y"): g("Ỹ"), g("Ý"): g("Ỹ"), g("Ỳ"): g("Ỹ"), g("Ỷ"): g("Ỹ"), g("Ỵ"): g("Ỹ"),
            ],
            DAU_NANG: [
                g("a"): g("ạ"), g("á"): g("ạ"), g("à"): g("ạ"), g("ả"): g("ạ"), g("ã"): g("ạ"),
                g("ă"): g("ặ"), g("ắ"): g("ặ"), g("ằ"): g("ặ"), g("ẳ"): g("ặ"), g("ẵ"): g("ặ"),
                g("â"): g("ậ"), g("ấ"): g("ậ"), g("ầ"): g("ậ"), g("ẩ"): g("ậ"), g("ẫ"): g("ậ"),
                g("o"): g("ọ"), g("ó"): g("ọ"), g("ò"): g("ọ"), g("ỏ"): g("ọ"), g("õ"): g("ọ"),
                g("ô"): g("ộ"), g("ố"): g("ộ"), g("ồ"): g("ộ"), g("ổ"): g("ộ"), g("ỗ"): g("ộ"),
                g("ơ"): g("ợ"), g("ớ"): g("ợ"), g("ờ"): g("ợ"), g("ở"): g("ợ"), g("ỡ"): g("ợ"),
                g("e"): g("ẹ"), g("é"): g("ẹ"), g("è"): g("ẹ"), g("ẻ"): g("ẹ"), g("ẽ"): g("ẹ"),
                g("ê"): g("ệ"), g("ế"): g("ệ"), g("ề"): g("ệ"), g("ể"): g("ệ"), g("ễ"): g("ệ"),
                g("u"): g("ụ"), g("ú"): g("ụ"), g("ù"): g("ụ"), g("ủ"): g("ụ"), g("ũ"): g("ụ"),
                g("ư"): g("ự"), g("ứ"): g("ự"), g("ừ"): g("ự"), g("ử"): g("ự"), g("ữ"): g("ự"),
                g("i"): g("ị"), g("í"): g("ị"), g("ì"): g("ị"), g("ỉ"): g("ị"), g("ĩ"): g("ị"),
                g("y"): g("ỵ"), g("ý"): g("ỵ"), g("ỳ"): g("ỵ"), g("ỷ"): g("ỵ"), g("ỹ"): g("ỵ"),

                g("A"): g("Ạ"), g("Á"): g("Ạ"), g("À"): g("Ạ"), g("Ả"): g("Ạ"), g("Ã"): g("Ạ"),
                g("Ă"): g("Ặ"), g("Ắ"): g("Ặ"), g("Ằ"): g("Ặ"), g("Ẳ"): g("Ặ"), g("Ẵ"): g("Ặ"),
                g("Â"): g("Ậ"), g("Ấ"): g("Ậ"), g("Ầ"): g("Ậ"), g("Ẩ"): g("Ậ"), g("Ẫ"): g("Ậ"),
                g("O"): g("Ọ"), g("Ó"): g("Ọ"), g("Ò"): g("Ọ"), g("Ỏ"): g("Ọ"), g("Õ"): g("Ọ"),
                g("Ô"): g("Ộ"), g("Ố"): g("Ộ"), g("Ồ"): g("Ộ"), g("Ổ"): g("Ộ"), g("Ỗ"): g("Ộ"),
                g("Ơ"): g("Ợ"), g("Ớ"): g("Ợ"), g("Ờ"): g("Ợ"), g("Ở"): g("Ợ"), g("Ỡ"): g("Ợ"),
                g("E"): g("Ẹ"), g("É"): g("Ẹ"), g("È"): g("Ẹ"), g("Ẻ"): g("Ẹ"), g("Ẽ"): g("Ẹ"),
                g("Ê"): g("Ệ"), g("Ế"): g("Ệ"), g("Ề"): g("Ệ"), g("Ể"): g("Ệ"), g("Ễ"): g("Ệ"),
                g("U"): g("Ụ"), g("Ú"): g("Ụ"), g("Ù"): g("Ụ"), g("Ủ"): g("Ụ"), g("Ũ"): g("Ụ"),
                g("Ư"): g("Ự"), g("Ứ"): g("Ự"), g("Ừ"): g("Ự"), g("Ử"): g("Ự"), g("Ữ"): g("Ự"),
                g("I"): g("Ị"), g("Í"): g("Ị"), g("Ì"): g("Ị"), g("Ỉ"): g("Ị"), g("Ĩ"): g("Ị"),
                g("Y"): g("Ỵ"), g("Ý"): g("Ỵ"), g("Ỳ"): g("Ỵ"), g("Ỷ"): g("Ỵ"), g("Ỹ"): g("Ỵ"),
            ],
            DAU_MU: [
                g("a"): g("â"), g("á"): g("ấ"), g("à"): g("ầ"), g("ả"): g("ẩ"), g("ã"): g("ẫ"),
                g("ạ"): g("ậ"), g("ă"): g("â"), g("ắ"): g("ấ"), g("ằ"): g("ầ"), g("ẳ"): g("ẩ"),
                g("ẵ"): g("ẫ"), g("ặ"): g("ậ"), g("o"): g("ô"), g("ó"): g("ố"), g("ò"): g("ồ"),
                g("ỏ"): g("ổ"), g("õ"): g("ỗ"), g("ọ"): g("ộ"), g("ơ"): g("ô"), g("ớ"): g("ố"),
                g("ờ"): g("ồ"), g("ở"): g("ổ"), g("ỡ"): g("ỗ"), g("ợ"): g("ộ"), g("e"): g("ê"),
                g("é"): g("ế"), g("è"): g("ề"), g("ẻ"): g("ể"), g("ẽ"): g("ễ"), g("ẹ"): g("ệ"),

                g("A"): g("Â"), g("Á"): g("Ấ"), g("À"): g("Ầ"), g("Ả"): g("Ẩ"), g("Ã"): g("Ẫ"),
                g("Ạ"): g("Ậ"), g("Ă"): g("Â"), g("Ắ"): g("Ấ"), g("Ằ"): g("Ầ"), g("Ẳ"): g("Ẩ"),
                g("Ẵ"): g("Ẫ"), g("Ặ"): g("Ậ"), g("O"): g("Ô"), g("Ó"): g("Ố"), g("Ò"): g("Ồ"),
                g("Ỏ"): g("Ổ"), g("Õ"): g("Ỗ"), g("Ọ"): g("Ộ"), g("Ơ"): g("Ô"), g("Ớ"): g("Ố"),
                g("Ờ"): g("Ồ"), g("Ở"): g("Ổ"), g("Ỡ"): g("Ỗ"), g("Ợ"): g("Ộ"), g("E"): g("Ê"),
                g("É"): g("Ế"), g("È"): g("Ề"), g("Ẻ"): g("Ể"), g("Ẽ"): g("Ễ"), g("Ẹ"): g("Ệ"),
            ],
            DAU_RAU: [
                g("ỏ"): g("ở"), g("õ"): g("ỡ"), g("ọ"): g("ợ"), g("ô"): g("ơ"), g("ố"): g("ớ"),
                g("ồ"): g("ờ"), g("ổ"): g("ở"), g("ỗ"): g("ỡ"), g("ộ"): g("ợ"), g("u"): g("ư"),
                g("ú"): g("ứ"), g("ù"): g("ừ"), g("ủ"): g("ử"), g("ũ"): g("ữ"), g("ụ"): g("ự"),
                g("Ỏ"): g("Ở"), g("Õ"): g("Ỡ"), g("Ọ"): g("Ợ"), g("Ô"): g("Ơ"), g("Ố"): g("Ớ"),
                g("Ồ"): g("Ờ"), g("Ổ"): g("Ở"), g("Ỗ"): g("Ỡ"), g("Ộ"): g("Ợ"), g("U"): g("Ư"),
                g("Ú"): g("Ứ"), g("Ù"): g("Ừ"), g("Ủ"): g("Ử"), g("Ũ"): g("Ữ"), g("Ụ"): g("Ự"),
                g("o"): g("ơ"), g("ó"): g("ớ"), g("ò"): g("ờ"),
                g("O"): g("Ơ"), g("Ó"): g("Ớ"), g("Ò"): g("Ờ"),
            ],
            DAU_RAU_2: [
                g("a"): g("ă"), g("á"): g("ắ"), g("à"): g("ằ"), g("ả"): g("ẳ"), g("ã"): g("ẵ"),
                g("ạ"): g("ặ"), g("â"): g("ă"), g("ấ"): g("ắ"), g("ầ"): g("ằ"), g("ẩ"): g("ẳ"),
                g("ẫ"): g("ẵ"), g("ậ"): g("ặ"),
                g("A"): g("Ă"), g("Á"): g("Ắ"), g("À"): g("Ằ"), g("Ả"): g("Ẳ"), g("Ã"): g("Ẵ"),
                g("Ạ"): g("Ặ"), g("Â"): g("Ă"), g("Ấ"): g("Ắ"), g("Ầ"): g("Ằ"), g("Ẩ"): g("Ẳ"),
                g("Ẫ"): g("Ẵ"), g("Ậ"): g("Ặ"),
            ],
            DAU_NGANG: [
                g("d"): g("đ"),
                g("D"): g("Đ"),
            ],
        ]
    }

    func getControlMap(char: UniChar) -> [UniChar: UniChar]? {
        return CONTROL_CHAR[char];
    }

}
